20240511T103303--kdoc-171-pdf本棚を作る__project.org
:properties:
:ID: 20240511T103303
:mtime:    20250501203036
:ctime:    20241028101410
:end:
#+title:      KDOC 171: PDF本棚を作る
#+date:       [2024-05-11 Sat 10:33]
#+filetags:   :project:
#+identifier: 20240511T103303

* この文書のステータス
- 作成
  - [X] 2024-05-13 貴島
- レビュー
  - [X] 2024-05-19 貴島
* DONE プロジェクトのステータス
CLOSED: [2024-11-11 Mon 12:57]

プロジェクトは完了である。

* 概要

本はPDFで買うようにしている。いい感じにブラウザでPDFを一覧表示して読み始めるためのコードを書いた。

- リポジトリ: [[https://github.com/kijimaD/shelf][shelf]]
- 設定の実例: [[https://github.com/kijimaD/mypdfs][mypdfs]]

* 関連

- [[id:20240324T120408][KDOC 127: ChromeのPDFビューワでしおりを使う]]。背景
- [[id:20240511T041838][KDOC 170: しおりを自動化した]]。この機能を含めた

* Tasks
** TODO タイトル検索できるようにする
検索する。
** TODO 偶然IDフォーマットが一致することがある
文字数だけしか見てないから、たまに一致する。修正する。
** TODO 表示数をいじれるようにする
URLは受け取れるが、まだボタンがない。
** TODO オフライン時に表示がおかしい
tailwindがダウンロードできてないから。これもコードに入れてしまう。
* Archive
** DONE 設定ファイルが乱立して扱いが面倒
CLOSED: [2024-05-11 Sat 10:34]
:LOGBOOK:
CLOCK: [2024-05-11 Sat 02:46]--[2024-05-11 Sat 03:11] =>  0:25
CLOCK: [2024-05-11 Sat 02:20]--[2024-05-11 Sat 02:45] =>  0:25
CLOCK: [2024-05-11 Sat 01:36]--[2024-05-11 Sat 02:01] =>  0:25
CLOCK: [2024-05-11 Sat 01:11]--[2024-05-11 Sat 01:36] =>  0:25
CLOCK: [2024-05-10 Fri 00:47]--[2024-05-10 Fri 01:12] =>  0:25
:END:
1ファイルにしたほうがよさそう。
** DONE pdfjsリンクを追加する
CLOSED: [2024-05-10 Fri 00:47]
:LOGBOOK:
CLOCK: [2024-05-10 Fri 00:22]--[2024-05-10 Fri 00:47] =>  0:25
CLOCK: [2024-05-09 Thu 23:13]--[2024-05-09 Thu 23:38] =>  0:25
:END:

リンクを追加する。
** DONE タグをエントリにも表示する
CLOSED: [2024-05-11 Sat 11:04]
今はボタンしか表示してないので、個別の本にも表示する。
** DONE リンクを設定化する
CLOSED: [2024-05-11 Sat 11:04]
相対パスにして解決した。

viewに埋め込んでいるので、別環境だと動かなかったりする。

- localhost じか埋め込みなので、アドレス指定でアクセスしたとき動かないなど
** DONE ブックマークでズーム率を保持する
CLOSED: [2024-05-13 Mon 22:50]
上書きしてるのを直す。
** DONE ページ量を可視化する
CLOSED: [2024-05-13 Mon 22:50]
:LOGBOOK:
CLOCK: [2024-05-13 Mon 21:55]--[2024-05-13 Mon 22:20] =>  0:25
CLOCK: [2024-05-13 Mon 21:18]--[2024-05-13 Mon 21:43] =>  0:25
CLOCK: [2024-05-13 Mon 20:32]--[2024-05-13 Mon 20:57] =>  0:25
CLOCK: [2024-05-13 Mon 20:07]--[2024-05-13 Mon 20:32] =>  0:25
:END:
ゲージを作る。

更新が面倒。既存コードの複数ヶ所に埋め込むのが嫌だな。

いいフックがあった。

#+begin_src javascript
  document.addEventListener("webviewerloaded", () => {
      PDFViewerApplication.initializedPromise.then(() => {
          PDFViewerApplication.eventBus.on("pagechanging", (e) => {
              console.log('pagechanging, from ' + e.previous + ' to ' + e.pageNumber);
          });
      });
  });
#+end_src
** DONE ページ移動でログ表示する
CLOSED: [2024-05-15 Wed 00:47]
:LOGBOOK:
CLOCK: [2024-05-14 Tue 22:46]--[2024-05-14 Tue 23:11] =>  0:25
CLOCK: [2024-05-14 Tue 22:21]--[2024-05-14 Tue 22:46] =>  0:25
CLOCK: [2024-05-14 Tue 21:56]--[2024-05-14 Tue 22:21] =>  0:25
:END:

- かかった時間
- https://ics.media/entry/230530/ を参考にしてメッセージ表示した
** DONE ページごとに演出を入れる
CLOSED: [2024-05-15 Wed 00:47]

色を変えるようにした。

- 1ページごと
- 10ページごと
- 100ページごと
