20240511T103303--kdoc-171-pdf本棚を作る__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-22T13:10:35Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 171: PDF本棚を作る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 171: PDF本棚を作る</h1>
<div id="outline-container-org1981587" class="outline-2">
<h2 id="org1981587"><a href="#org1981587">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1981587">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-13 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9125f6d" class="outline-2">
<h2 id="org9125f6d"><a href="#org9125f6d"><span class="done DONE">DONE</span> プロジェクトのステータス</a></h2>
<div class="outline-text-2" id="text-org9125f6d">
<p>
プロジェクトは完了である。
</p>
</div>
</div>
<div id="outline-container-org9a12095" class="outline-2">
<h2 id="org9a12095"><a href="#org9a12095">概要</a></h2>
<div class="outline-text-2" id="text-org9a12095">
<p>
本はPDFで買うようにしている。いい感じにブラウザでPDFを一覧表示して読み始めるためのコードを書いた。
</p>

<ul class="org-ul">
<li>リポジトリ: <a href="https://github.com/kijimaD/shelf">shelf</a></li>
<li>設定の実例: <a href="https://github.com/kijimaD/mypdfs">mypdfs</a></li>
</ul>
</div>
</div>
<div id="outline-container-org34d4a39" class="outline-2">
<h2 id="org34d4a39"><a href="#org34d4a39">関連</a></h2>
<div class="outline-text-2" id="text-org34d4a39">
<ul class="org-ul">
<li><a href="20240324T120408--kdoc-127-chromeのpdfビューワでしおりを使う__essay.html#ID-20240324T120408">KDOC 127: ChromeのPDFビューワでしおりを使う</a>。背景</li>
<li><a href="20240511T041838--kdoc-170-pdfしおりを使いやすくする__wiki.html#ID-20240511T041838">KDOC 170: しおりを自動化した</a>。この機能を含めた</li>
</ul>
</div>
</div>
<div id="outline-container-org8c4b4bd" class="outline-2">
<h2 id="org8c4b4bd"><a href="#org8c4b4bd">Tasks</a></h2>
<div class="outline-text-2" id="text-org8c4b4bd">
</div>
<div id="outline-container-orgffb16aa" class="outline-3">
<h3 id="orgffb16aa"><a href="#orgffb16aa"><span class="todo TODO">TODO</span> タイトル検索できるようにする</a></h3>
<div class="outline-text-3" id="text-orgffb16aa">
<p>
検索する。
</p>
</div>
</div>
<div id="outline-container-org555a870" class="outline-3">
<h3 id="org555a870"><a href="#org555a870"><span class="todo TODO">TODO</span> 偶然IDフォーマットが一致することがある</a></h3>
<div class="outline-text-3" id="text-org555a870">
<p>
文字数だけしか見てないから、たまに一致する。修正する。
</p>
</div>
</div>
<div id="outline-container-orgf239a76" class="outline-3">
<h3 id="orgf239a76"><a href="#orgf239a76"><span class="todo TODO">TODO</span> 表示数をいじれるようにする</a></h3>
<div class="outline-text-3" id="text-orgf239a76">
<p>
URLは受け取れるが、まだボタンがない。
</p>
</div>
</div>
<div id="outline-container-org9bd5a64" class="outline-3">
<h3 id="org9bd5a64"><a href="#org9bd5a64"><span class="todo TODO">TODO</span> オフライン時に表示がおかしい</a></h3>
<div class="outline-text-3" id="text-org9bd5a64">
<p>
tailwindがダウンロードできてないから。これもコードに入れてしまう。
</p>
</div>
</div>
</div>
<div id="outline-container-org0df821b" class="outline-2">
<h2 id="org0df821b"><a href="#org0df821b">Archive</a></h2>
<div class="outline-text-2" id="text-org0df821b">
</div>
<div id="outline-container-orgaebe31f" class="outline-3">
<h3 id="orgaebe31f"><a href="#orgaebe31f"><span class="done DONE">DONE</span> 設定ファイルが乱立して扱いが面倒</a></h3>
<div class="outline-text-3" id="text-orgaebe31f">
<p>
1ファイルにしたほうがよさそう。
</p>
</div>
</div>
<div id="outline-container-org435f645" class="outline-3">
<h3 id="org435f645"><a href="#org435f645"><span class="done DONE">DONE</span> pdfjsリンクを追加する</a></h3>
<div class="outline-text-3" id="text-org435f645">
<p>
リンクを追加する。
</p>
</div>
</div>
<div id="outline-container-orge2f062b" class="outline-3">
<h3 id="orge2f062b"><a href="#orge2f062b"><span class="done DONE">DONE</span> タグをエントリにも表示する</a></h3>
<div class="outline-text-3" id="text-orge2f062b">
<p>
今はボタンしか表示してないので、個別の本にも表示する。
</p>
</div>
</div>
<div id="outline-container-orgfd04c57" class="outline-3">
<h3 id="orgfd04c57"><a href="#orgfd04c57"><span class="done DONE">DONE</span> リンクを設定化する</a></h3>
<div class="outline-text-3" id="text-orgfd04c57">
<p>
相対パスにして解決した。
</p>

<p>
viewに埋め込んでいるので、別環境だと動かなかったりする。
</p>

<ul class="org-ul">
<li>localhost じか埋め込みなので、アドレス指定でアクセスしたとき動かないなど</li>
</ul>
</div>
</div>
<div id="outline-container-org0f2f2d1" class="outline-3">
<h3 id="org0f2f2d1"><a href="#org0f2f2d1"><span class="done DONE">DONE</span> ブックマークでズーム率を保持する</a></h3>
<div class="outline-text-3" id="text-org0f2f2d1">
<p>
上書きしてるのを直す。
</p>
</div>
</div>
<div id="outline-container-org37e2b58" class="outline-3">
<h3 id="org37e2b58"><a href="#org37e2b58"><span class="done DONE">DONE</span> ページ量を可視化する</a></h3>
<div class="outline-text-3" id="text-org37e2b58">
<p>
ゲージを作る。
</p>

<p>
更新が面倒。既存コードの複数ヶ所に埋め込むのが嫌だな。
</p>

<p>
いいフックがあった。
</p>

<div class="org-src-container">
<pre class="src src-javascript">document.addEventListener(<span class="org-string">"webviewerloaded"</span>, () =&gt; {
    PDFViewerApplication.initializedPromise.then(() =&gt; {
        PDFViewerApplication.eventBus.on(<span class="org-string">"pagechanging"</span>, (e) =&gt; {
            console.log(<span class="org-string">'pagechanging, from '</span> + e.previous + <span class="org-string">' to '</span> + e.pageNumber);
        });
    });
});
</pre>
</div>
</div>
</div>
<div id="outline-container-org72c89ff" class="outline-3">
<h3 id="org72c89ff"><a href="#org72c89ff"><span class="done DONE">DONE</span> ページ移動でログ表示する</a></h3>
<div class="outline-text-3" id="text-org72c89ff">
<ul class="org-ul">
<li>かかった時間</li>
<li><a href="https://ics.media/entry/230530/">https://ics.media/entry/230530/</a> を参考にしてメッセージ表示した</li>
</ul>
</div>
</div>
<div id="outline-container-org2400507" class="outline-3">
<h3 id="org2400507"><a href="#org2400507"><span class="done DONE">DONE</span> ページごとに演出を入れる</a></h3>
<div class="outline-text-3" id="text-org2400507">
<p>
色を変えるようにした。
</p>

<ul class="org-ul">
<li>1ページごと</li>
<li>10ページごと</li>
<li>100ページごと</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
